Repository: BeeWise/jokes-flutter-app
Catalog: Jokes/lib/localization/app_*.arb
Languages: ro

# operationErrorUnknown
source: Whoops! An error occurred... We're just kidding, please try again! 😂
ro: Ups! A apărut o eroare... Doar glumim, te rog să încerci din nou! 😂

# operationErrorNoUrlAvailable
source: Whoops! An error occurred... We're just kidding, please try again! 😂
ro: Ups! A apărut o eroare... Doar glumim, te rog să încerci din nou! 😂

# operationErrorNoDataAvailable
source: Whoops! An error occurred... We're just kidding, please try again! 😂
ro: Ups! A apărut o eroare... Doar glumim, te rog să încerci din nou! 😂

# operationErrorCannotParseResponse
source: Whoops! An error occurred... We're just kidding, please try again! 😂
ro: Ups! A apărut o eroare... Doar glumim, te rog să încerci din nou! 😂

# operationErrorOperationCancelled
source: Whoops! An error occurred... We're just kidding, please try again! 😂
ro: Ups! A apărut o eroare... Doar glumim, te rog să încerci din nou! 😂

# operationErrorNoInternetConnection
source: Whoops! You don't have Internet connection. Please try later!
ro: Ups! Nu ai conexiune la Internet. Te rog să încerci mai târziu!

# cancelTitle
source: Cancel
ro: Anulează

# saveTitle
source: Save
ro: Salvează

# jokesTitle
source: Jokes
ro: Glume

# jokeTypeQnaTitle
source: Question & answer
ro: Întrebare și răspuns

# jokeStatusPendingTitle
source: Pending
ro: În așteptare

# jokeStatusApprovedTitle
source: Approved
ro: Aprobat

# jokeStatusRejectedTitle
source: Rejected
ro: Refuzat

# jokeStatusAdminRemovedTitle
source: Removed by admin
ro: Eliminat de admin

# jokeStatusOwnerRemovedTitle
source: Removed
ro: Eliminat

# shareJokeTitle
source: Share joke
ro: Distribuie gluma

# shareJokeMessage
source: Do you want to laugh? Read a good joke. 🤣
ro: Vrei să râzi? Citește o glumă bună. 🤣

# readAnswerTitle
source: Read the answer
ro: Citește răspunsul

# jokesSceneJokeOfTheDayTitle
source: 🔥Joke of the day
ro: 🔥Gluma zilei

# jokesSceneJokeOfTheWeekTitle
source: 🔥Joke of the week
ro: 🔥Gluma săptămânii

# jokesSceneJokeOfTheMonthTitle
source: 🔥Joke of the month
ro: 🔥Gluma lunii

# jokesSceneJokeOfTheYearTitle
source: 🔥Joke of the year
ro: 🔥Gluma anului

# jokesSceneNoMoreItemsText
source: No more jokes
ro: Nu mai sunt glume

# jokesSceneErrorText
source: An error occurred while fetching jokes. Refetch jokes ↺
ro: A apărut o eroare. Reîncarcă glumele ↺

# jokesSceneSourceText
source: Source: {source}
ro: Sursă: {source}
